Autodesk.Revit.DB.Structure.Rebar.ScaleToBoxFor3D(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Double)
Move and resize a spiral or multiplanar instance to fit within a specified box.
The arguments are interpreted as an arbitrary rectangle in 3D with
vertices: origin, origin+xVec, origin+xVec+yVec, origin+yVec. One end of the
rebar shape is inscribed in this rectangle following the procedure described
for the ScaleToBox method. The other end is placed in the parallel plane at
distance (center-to-center) given by the height argument, in the
direction of (xVec x yVec).
Note that spiral shapes interpret the input arguments using a different convention
than multiplanar shapes.  For spiral shapes, the spiral start will be placed in
the rectangle defined by origin, xVec, yVec, and the end of the spiral will be
placed in the parallel plane.  For multiplanar shapes, the rebar is placed with
its primary shape definition located in the parallel plane defined by the height
argument, and its connector segments extending in the direction opposite (xVec x yVec).
This method replaces ScaleToBoxForSpiral() from prior releases.
origin:
One corner of the rectangle.
xVec:
Vector representing the first edge of the rectangle. The length
must be positive.
yVec:
Vector representing the second edge of the rectangle. Must
be perpendicular to xVec.
height:
New value for the Height or MultiplanarDepth property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xVec has zero length.
-or-
yVec has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Rebar is not an instance of a spiral or multiplanar shape.
-or-
This method applies only to shape driven rebar.
-or-
The operation has failed for geometric reasons, such as the box being too small
given the bar diameter.
Since:
2012

Autodesk.Revit.DB.Structure.Rebar.ScaleToBox(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Move and resize the bar to fit within a specified box.
The arguments are interpreted as an arbitrary
rectangle in 3D with vertices: origin, origin+xVec,
origin+xVec+yVec, origin+yVec. The algorithm then
proceeds as follows. First the bar is given the
default values of the shape parameters from the shape
definition. Then, if it is possible to do so without
violating the shape definition, the parameter values
are scaled so that the width and height of the shape
(including bar thickness) match the lengths of xVec and yVec.
If there is no way to do this within the shape definition
due to overconstraining, a compromise is attempted, such as
scaling the whole shape until either the width or the
height is correct. Finally the shape is rotated to
match the coordinate system of the box. The algorithm
is the same one used in one-click placement.
origin:
One corner of the rectangle.
xVec:
Vector representing the first edge of the rectangle. The length
must be positive.
yVec:
Vector representing the second edge of the rectangle. Must
be perpendicular to xVec.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xVec has zero length.
-or-
yVec has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This Rebar is an instance of a spiral or multiplanar shape.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This method applies only to shape driven rebar.
-or-
The operation has failed for geometric reasons, such as the box being too small
given the bar diameter.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.GetShapeId
Returns the id of the RebarShape element that defines the shape of the rebar.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SetLayoutAsMinimumClearSpacing(System.Double,System.Double,System.Boolean,System.Boolean,System.Boolean)
Sets the Layout Rule property of rebar set to MinimumClearSpacing
Remarks:
When changing the layout rule to MinimumClearSpacing, you must also simultaneously set Spacing,
SetLength, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
spacing:
The maximum spacing between rebar in rebar set
arrayLength:
The distribution length of rebar set
barsOnNormalSide:
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar:
Identifies if the first bar in rebar set is shown
includeLastBar:
Identifies if the last bar in rebar set is shown
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The spacing isn't bigger than 0.0.
-or-
the set length arrayLength isn't acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This Rebar is an instance of a spiral or multiplanar shape.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This method applies only to shape driven rebar.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SetLayoutAsNumberWithSpacing(System.Int32,System.Double,System.Boolean,System.Boolean,System.Boolean)
Sets the Layout Rule property of rebar set to NumberWithSpacing
Remarks:
When changing the layout rule to NumberWithSpacing, you must also simultaneously set NumberOfBarPositions,
Spacing, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
numberOfBarPositions:
The number of bar positions in rebar set
spacing:
The maximum spacing between rebar in rebar set
barsOnNormalSide:
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar:
Identifies if the first bar in rebar set is shown
includeLastBar:
Identifies if the last bar in rebar set is shown
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the number of bar positions numberOfBarPositions is less than 1 or more than 1002.
-or-
The spacing isn't bigger than 0.0.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This Rebar is an instance of a spiral or multiplanar shape.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This method applies only to shape driven rebar.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SetLayoutAsMaximumSpacing(System.Double,System.Double,System.Boolean,System.Boolean,System.Boolean)
Sets the Layout Rule property of rebar set to MaximumSpacing
Remarks:
When changing the layout rule to MaximumSpacing, you must also simultaneously set Spacing,
SetLength, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
spacing:
The maximum spacing between rebar in rebar set
arrayLength:
The distribution length of rebar set
barsOnNormalSide:
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar:
Identifies if the first bar in rebar set is shown
includeLastBar:
Identifies if the last bar in rebar set is shown
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The spacing isn't bigger than 0.0.
-or-
the set length arrayLength isn't acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This Rebar is an instance of a spiral or multiplanar shape.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This method applies only to shape driven rebar.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SetLayoutAsFixedNumber(System.Int32,System.Double,System.Boolean,System.Boolean,System.Boolean)
Sets the Layout Rule property of rebar set to FixedNumber.
Remarks:
When changing the layout rule to FixedNumber, you must also simultaneously set NumberOfBarPositions,
SetLength, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
numberOfBarPositions:
The number of bar positions in rebar set
arrayLength:
The distribution length of rebar set
barsOnNormalSide:
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar:
Identifies if the first bar in rebar set is shown
includeLastBar:
Identifies if the last bar in rebar set is shown
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the number of bar positions numberOfBarPositions is less than 1 or more than 1002.
-or-
the set length arrayLength isn't acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This Rebar is an instance of a spiral or multiplanar shape.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This method applies only to shape driven rebar.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SetLayoutAsSingle
Sets the Layout Rule property of rebar set to Single.
Remarks:
Only one bar will remain, which is at the position of rebar plane
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This method applies only to shape driven rebar.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.ComputeDrivingCurves
Compute the driving curves.
Remarks:
The driving curves are the ones that appear in rebar sketch
mode. They include lines and arcs that drive the shape, but
exclude fillets and hooks. They always lie in a plane--
if the bar is 3D, these curves are a subset or a projection.
They are also used for shape matching.
Returns:
Returns an empty array if an error is encountered.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This method applies only to shape driven rebar.
Since:
2014

Autodesk.Revit.DB.Structure.Rebar.GetBarPositionTransform(System.Int32)
Return a transform representing the relative position of any
individual bar in the set.
Remarks:
The transform is a translation along the distribution path.
It can be applied to the results of GetCenterlineCurves() to
produce any bar in the rebar set. For barPositionIndex=0,
the identity transform is always returned.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
Returns:
The position of a bar in the set relative to the first position.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This method applies only to shape driven rebar.
Since:
2013

Autodesk.Revit.DB.Structure.Rebar.GetDistributionPath
The distribution path of a rebar set.
Returns:
A line beginning at (0, 0, 0) and representing the direction and
length of the set.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This method applies only to shape driven rebar.
Since:
2013

Autodesk.Revit.DB.Structure.Rebar.RebarShapeId
The RebarShape element that defines the shape of the rebar.
Remarks:
Changing the value of this property causes the Rebar instance to choose values for its
shape parameters to preserve its previous shape as closely as possible
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: shapeId is not the id of a RebarShape in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This method applies only to shape driven rebar.
Since:
2013

Autodesk.Revit.DB.Structure.Rebar.MultiplanarDepth
For a multiplanar rebar, the depth of the instance.
Remarks:
Applicable only when an instance of a RebarShape with
a RebarShapeMultiplanarDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: multiplanarDepth must be positive.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Rebar is not an instance of a multiplanar shape.
-or-
This method applies only to shape driven rebar.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.Pitch
For a spiral, the pitch, or vertical distance traveled in one rotation.
Remarks:
Applies only to instances where RebarShape.Definition is of type
RebarShapeDefinitionByArc, and its Type property is equal to the value
RebarShapeDefinitionByArcType.Spiral.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: pitch must be positive.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Rebar is not an instance of a spiral shape.
-or-
This method applies only to shape driven rebar.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.TopFinishingTurns
For a spiral, the number of finishing turns at the upper end of the spiral.
Remarks:
Applies only to instances where RebarShape.Definition is of type
RebarShapeDefinitionByArc, and its Type property is equal to the value
RebarShapeDefinitionByArcType.Spiral.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: turns must be between 0 and 100.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Rebar is not an instance of a spiral shape.
-or-
This method applies only to shape driven rebar.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.BaseFinishingTurns
For a spiral, the number of finishing turns at the lower end of the spiral.
Remarks:
Applies only to instances where RebarShape.Definition is of type
RebarShapeDefinitionByArc, and its Type property is equal to the value
RebarShapeDefinitionByArcType.Spiral.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: turns must be between 0 and 100.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Rebar is not an instance of a spiral shape.
-or-
This method applies only to shape driven rebar.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.Height
For a spiral, the overall height.
Remarks:
Applies only to instances where RebarShape.Definition is of type
RebarShapeDefinitionByArc, and its Type property is equal to the value
RebarShapeDefinitionByArcType.Spiral.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: height must be positive.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Rebar is not an instance of a spiral shape.
-or-
This method applies only to shape driven rebar.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.ArrayLength
Identifies the distribution path length of rebar set.
The distribution path length of rebar set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: the set length arrayLength isn't acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This method applies only to shape driven rebar.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.BarsOnNormalSide
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal.
True if the bars of rebar set are on the same side of the rebar plane indicated by the normal,
and false if the bars are on the opposite side.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This method applies only to shape driven rebar.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.Normal
A unit-length vector normal to the plane of the rebar
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This method applies only to shape driven rebar.
Since:
2009